patrick_horne/week-9/mountains/app/controllers/mountains_controller.rb

SELECT "mountains".* FROM "mountains" WHERE "mountains"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @mountain = Mountain.find_by(id: params[:id])

SELECT "mountains".* FROM "mountains" WHERE "mountains"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
---
  def edit
    @mountain = Mountain.find_by(id: params[:id])

SELECT "mountains".* FROM "mountains" WHERE "mountains"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
---
  def delete
    mountain = Mountain.find_by(id: :id)