sean_cooper/2019-10-12/solar_system/app/controllers/mountains_controller.rb

    def update
        mountain = Mountain.find params[:id]
        mountain.name = params[:name]
        mountain.image = params[:image]
        mountain.description = params[:description]
        mountain.rating = params[:rating]
        mountain.save
---
SELECT  "mountains".* FROM "mountains" WHERE "mountains"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "mountains" SET "name" = ?, "image" = ?, "description" = ? WHERE "mountains"."id" = ?  [["name", "Mt Fuji"], ["image", "https://www.placecage.com/gif/284/196"], ["description", "Japan mountain"], ["id", 2]]

    def destroy
        mountain = Mountain.find params[:id]
        mountain.destroy
---
SELECT  "mountains".* FROM "mountains" WHERE "mountains"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
DELETE FROM "mountains" WHERE "mountains"."id" = ?  [["id", 4]]