sean_cooper/2019-10-12/solar_system/app/controllers/movies_controller.rb

SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def show
        @movie = Movie.find params[:id]

SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "movies" SET "image" = ? WHERE "movies"."id" = ?  [["image", "https://www.placecage.com/gif/284/196"], ["id", 2]]
---
    def update
        movie = Movie.find params[:id]
        movie.name = params[:name]
        movie.image = params[:image]
        movie.description = params[:description]
        movie.rating = params[:rating]
        movie.save