sean_cooper/2019-10-12/solar_system/app/controllers/oceans_controller.rb

    def index
        @oceans = Ocean.all
---
SELECT "oceans".* FROM "oceans"

    def show
        @ocean = Ocean.find params[:id]
---
SELECT  "oceans".* FROM "oceans" WHERE "oceans"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def edit
        @ocean = Ocean.find params[:id]
---
SELECT  "oceans".* FROM "oceans" WHERE "oceans"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def update
        ocean = Ocean.find params[:id]
        ocean.name = params[:name]
        ocean.image = params[:image]
        ocean.description = params[:description]
        ocean.rating = params[:rating]
        ocean.save
---
SELECT  "oceans".* FROM "oceans" WHERE "oceans"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "oceans" SET "name" = ?, "description" = ? WHERE "oceans"."id" = ?  [["name", "Pacific"], ["description", "pacific ocean"], ["id", 1]]

    def destroy
        ocean = Ocean.find params[:id]
        ocean.destroy
---
SELECT  "oceans".* FROM "oceans" WHERE "oceans"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
DELETE FROM "oceans" WHERE "oceans"."id" = ?  [["id", 4]]