sean_cooper/2019-10-12/solar_system/app/controllers/planets_controller.rb

  def create
    planet = Planet.new
    planet.name = params[:name]
    planet.image = params[:image]
    planet.orbit = params[:orbit]
    planet.diameter = params[:diameter]
    planet.mass = params[:mass]
    planet.moons = params[:moons]
    planet.save # INSERT, will set a new ID
---
INSERT INTO "planets" ("name", "image", "orbit", "diameter", "mass", "moons") VALUES (?, ?, ?, ?, ?, ?)

  def destroy
    planet = Planet.find params[:id]
    planet.destroy # Galactus
---
SELECT  "planets".* FROM "planets" WHERE "planets"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "planets" WHERE "planets"."id" = ?  [["id", 1]]